===============
Simple Function
===============

fn answer() { 42 }

---

(code
    (fn
        (identifier)
        (params)
        (body
            (int))))


===============
Function Params
===============


fn add(a, b) { a + b }

---

(code
    (fn
        (identifier)
        (params
            (identifier)
            (identifier))
        (body
            (bina
                (identifier)
                (identifier)))))


=============
Function Call
=============

add(1, 2)

---

(code
    (call
        (identifier)
        (args
            (int)
            (int))))

=============
One line Func
=============

fn mult(a, b) = a*b

---

(code
    (fn
        (identifier)
        (params
            (identifier)
            (identifier))
        (body
            (bina
                (identifier)
                (identifier)))))
